import React from 'react';
import styles from './Evaluate.module.scss';

const Evaluate = React.forwardRef((props, ref) => {
  function setDotsItems() {
    let items = [];
    for (let i = 0; i < 40; i++) {
      items.push(<div className={styles.Dots_item} key={i}></div>);
    }
    return items;
  }

  return (
    <div ref={ref} className={styles.Evaluate}>
      <div className={styles.ColumnLeft}>
        <h1 className={styles.Header}>Предварительная бесплатная оценка тендера</h1>
        <div className={styles.MainText}>
          Определим все подводные камни. <br /> Поможем еще до оплаты за услугу определить
          целесообразность участия.
        </div>
        <div className={styles.Dots}>{setDotsItems()}</div>
      </div>
      <div
        className={props.status ? styles.ColumnRight + ' ' + styles.Animation : styles.ColumnRight}>
        <svg
          className={styles.Arrow}
          width="52"
          height="56"
          viewBox="0 0 52 56"
          fill="none"
          xmlns="http://www.w3.org/2000/svg">
          <path
            d="M49.5161 7.41983C50.3002 7.68705 51.1525 7.268 51.4197 6.48386C51.687 5.69971 51.2679 4.84741 50.4838 4.58019L49.5161 7.41983ZM13.4186 55.3828C14.1822 55.7038 15.0616 55.345 15.3827 54.5814L20.6148 42.1365C20.9359 41.3728 20.5771 40.4935 19.8134 40.1724C19.0498 39.8513 18.1704 40.2101 17.8493 40.9738L13.1985 52.0359L2.13641 47.3851C1.37273 47.064 0.493366 47.4228 0.172294 48.1865C-0.148778 48.9502 0.210025 49.8295 0.973703 50.1506L13.4186 55.3828ZM13.9999 6.00001L14.8999 7.20001L13.9999 6.00001ZM49.9999 6.00001C50.4838 4.58019 50.4834 4.58005 50.4829 4.57988C50.4826 4.57978 50.482 4.57958 50.4814 4.57938C50.4802 4.57899 50.4787 4.57846 50.4768 4.57781C50.4729 4.57651 50.4676 4.57471 50.4608 4.57242C50.4472 4.56782 50.4276 4.56127 50.4023 4.55284C50.3516 4.53598 50.2779 4.51163 50.1822 4.48058C49.9908 4.41847 49.7116 4.3295 49.3539 4.21988C48.6387 4.00068 47.6088 3.6986 46.3394 3.36348C43.8035 2.69402 40.2968 1.88876 36.4239 1.35102C32.5579 0.814235 28.2809 0.537363 24.2186 0.948999C20.1683 1.35941 16.2116 2.46623 13.0999 4.80001L14.8999 7.20001C17.4118 5.31613 20.7668 4.31412 24.521 3.93372C28.263 3.55454 32.2832 3.80488 36.0113 4.32251C39.7325 4.83919 43.1169 5.61555 45.5737 6.26411C46.8005 6.58799 47.7924 6.87902 48.4748 7.08818C48.8159 7.19273 49.0795 7.27675 49.2562 7.33409C49.3445 7.36276 49.4111 7.38475 49.4548 7.3993C49.4767 7.40658 49.4928 7.41199 49.5031 7.41544C49.5082 7.41717 49.5119 7.41841 49.514 7.41914C49.5151 7.41951 49.5158 7.41975 49.5162 7.41987C49.5163 7.41992 49.5163 7.41992 49.5164 7.41994C49.5163 7.4199 49.5161 7.41983 49.9999 6.00001ZM13.0999 4.80001C8.9126 7.94049 6.92145 12.7908 6.18787 18.0372C5.45418 23.2842 5.94878 29.107 6.8993 34.479C7.85235 39.8653 9.27907 44.881 10.4639 48.5434C11.0571 50.3768 11.5914 51.8765 11.9784 52.9203C12.172 53.4423 12.3288 53.8507 12.4379 54.1301C12.4924 54.2698 12.5351 54.3773 12.5644 54.4507C12.579 54.4874 12.5904 54.5156 12.5982 54.535C12.6021 54.5447 12.6052 54.5522 12.6073 54.5575C12.6084 54.5601 12.6093 54.5622 12.6099 54.5638C12.6102 54.5645 12.6105 54.5653 12.6106 54.5657C12.6109 54.5662 12.6111 54.5667 13.9999 54C15.3887 53.4333 15.3888 53.4335 15.3888 53.4335C15.3888 53.4334 15.3887 53.4332 15.3886 53.4329C15.3883 53.4322 15.3878 53.4309 15.387 53.4291C15.3856 53.4255 15.3832 53.4197 15.38 53.4117C15.3735 53.3957 15.3636 53.371 15.3503 53.3378C15.3238 53.2714 15.2841 53.1712 15.2324 53.039C15.1292 52.7745 14.9785 52.3822 14.7913 51.8773C14.4168 50.8673 13.8967 49.4078 13.3182 47.6199C12.1599 44.0396 10.7749 39.1641 9.85342 33.9563C8.92942 28.7342 8.48676 23.26 9.15896 18.4526C9.83127 13.6445 11.5892 9.68308 14.8999 7.20001L13.0999 4.80001Z"
            fill="black"
          />
        </svg>
        <div className={styles.LawyerMessage}>
          <div className={styles.LawyerMessage_header}>
            <div className={styles.LawyerMessage_header_avatar}></div>
            <div>
              <p className={styles.LawyerMessage_header_name}>Юрист Тендерплана</p>
              <p className={styles.LawyerMessage_header_time}>сегодня в 11:32</p>
            </div>
          </div>
          <div className={styles.LawyerMessage_info}>
            Заказчик вправе запрашивать поставку отдельными мелкими партиями. Учитывайте
            дополнительные расходы на доставку.
          </div>
        </div>

        <div className={styles.ProjectExample}>
          <div className={styles.ProjectExample_title}>
            <svg
              width="16"
              height="16"
              viewBox="0 0 16 16"
              fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <rect width="16" height="16" fill="white" fillOpacity="0.01" />
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M2 0H14C14.5304 0 15.0391 0.210714 15.4142 0.585786C15.7893 0.960859 16 1.46957 16 2V14C16 14.5304 15.7893 15.0391 15.4142 15.4142C15.0391 15.7893 14.5304 16 14 16H2C1.46957 16 0.960859 15.7893 0.585786 15.4142C0.210714 15.0391 0 14.5304 0 14V2C0 1.46957 0.210714 0.960859 0.585786 0.585786C0.960859 0.210714 1.46957 0 2 0V0ZM3.235 4.258C3.16954 4.2672 3.10963 4.29984 3.06642 4.34987C3.0232 4.39989 2.9996 4.46389 3 4.53V11.499C3 11.635 3.1 11.751 3.236 11.769L10.189 12.731C10.2277 12.7364 10.2672 12.7335 10.3047 12.7224C10.3422 12.7112 10.3769 12.6922 10.4064 12.6665C10.4358 12.6408 10.4595 12.609 10.4756 12.5734C10.4918 12.5378 10.5001 12.4991 10.5 12.46V3.542C10.5 3.50287 10.4915 3.4642 10.4753 3.42862C10.459 3.39304 10.4352 3.36137 10.4056 3.33577C10.3761 3.31016 10.3413 3.29121 10.3038 3.28021C10.2662 3.26921 10.2267 3.26641 10.188 3.272L3.235 4.258ZM11.125 4.875V11.125H12.688C12.86 11.125 13 10.985 13 10.812V5.189C13.0001 5.14786 12.9921 5.1071 12.9764 5.06906C12.9608 5.03103 12.9377 4.99647 12.9086 4.96738C12.8795 4.93829 12.845 4.91524 12.8069 4.89956C12.7689 4.88387 12.7281 4.87587 12.687 4.876H11.125V4.875ZM6.803 7.602L6.012 10.4H5.177L4.057 6.172H4.977L5.637 9.152H5.684L6.454 6.172H7.201L7.987 9.152H8.033L8.687 6.172H9.6L8.479 10.4H7.649L6.849 7.602H6.803Z"
                fill="#2372BA"
              />
            </svg>
            <span>Проект контракта</span>
            <svg
              width="10"
              height="6"
              viewBox="0 0 10 6"
              fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path
                d="M1 1L5 5L9 1"
                stroke="#4B5E80"
                strokeWidth="2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
          </div>
          <div className={styles.ProjectExample_text}>
            <h3>3. Срок, место и условия поставки</h3>
            <p>
              <span className={styles.ProjectExample_text_number}>3.1.</span>
              <span className={styles.ProjectExample_text_description}>
                Срок поставки Товара: Поставка Товара поставщиком осуществляется с момента
                заключения контракта до 31.12.2021 г., по представленным поставщику заявкам от
                заказчика, в течении 5 (пяти) рабочих дней (но не позднее 18:00 ч.) со дня получения
                поставщиком заявки
              </span>
              , в которой указывается наименование и количество товара.
              <br />
            </p>
            <p>
              {' '}
              <span className={styles.ProjectExample_text_number}>3.2.</span> Условия поставки
              Товара: доставка товара осуществляется Поставщиком собственным транспортом или с
              привлевением третьих лиц за свой счет.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
});
export default Evaluate;
